app/controllers/articles_controller.rb

INSERT INTO "articles" ("reference", "created_at", "updated_at") VALUES (?, ?, ?)  [["reference", "reference6"], ["created_at", "2016-01-21 11:08:35.100100"], ["updated_at", "2016-01-21 11:08:35.100100"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "reference" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["reference", "reference2"], ["updated_at", "2016-01-21 09:27:02.317251"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)